import React from "react";
import NavigationWrapper from "./NavigationWrapper";
import { routes } from "@/constent";
import CommonHeader from "./CommonHeader";
import { useSelector } from "react-redux";

const LoanSuretyForm = () => {
  const user = useSelector((state) => state.agreement);

  return (
    <>
      <div
        className="max-w-3xl mx-auto bg-white p-8 font-sans text-sm leading-relaxed"
        style={{ minHeight: "297mm" }}
      >
        <CommonHeader />

        <div className="max-w-4xl mx-auto p-6">
          {/* <h1 className="text-2xl font-bold text-center text-blue-800 mb-6">
            जामीनदार करारनामा
          </h1> */}

          <p>
            आम्ही जामीनदार:
            <br />
            <ol>
              {user?.guarantors?.map((guarantor, index) => (
                <li key={index}>
                  {index + 1}. {guarantor}
                </li>
              ))}
            </ol>
          </p>

          <p className="mt-2">
            असा करार करतो की, आम्ही जामीनदार राहण्यास तयार असून, वर नमूद
            केलेल्या कर्जदारास रक्कम रुपये {user?.userInfo?.approvedAmount}/- ({" "}
            {user?.userInfo?.approvedAmountInWord} ) चेक नजर गहाणावर देण्याचे
            बँकेने मंजूर केले आहे. सबब, त्या रकमेपर्यंत जी रक्कम मूल कर्जदाराकडे
            येणे राहील, ती व त्यावर नमूद केलेल्या नजर गहाण रोख्याच्या
            शर्तीप्रमाणे व्याज आकारावे लागल्यास, त्या व्याजाची रक्कम भरण्यासाठी
            आम्ही जामीनदार राहिलो आहोत.
          </p>

          <p className="mt-2">
            व सदर रकमेची व्याजासहित परतफेड आम्ही जामीनदार व मूल कर्जदार हेजातीने
            करण्यास जबाबदार आहोत. कर्जदाराने कोणताही कर्जाचा हप्ता थकविल्यास तो
            थकबाकीदार होईलच, परंतु जामीनदार या नात्याने आम्ही देखील थकबाकीदार
            समजले जाऊ व ते आम्हाला कबूल आहे.
          </p>

          <p className="mt-2">
            बँकेने मूल कर्जदारास मदत वाढवून दिल्यास किंवा कर्ज फेडीच्या बाबतीत
            इतर कोणत्याही सवलती दिल्यास, त्यासाठी आमच्या संमतीची गरज नाही व
            त्यामुळे आमच्या जबाबदारीवर कोणताही वाद उरू नये असे आम्ही कबूल करतो.
          </p>

          <p className="mt-2">
            वर नमूद केलेला करार आमच्या वारस, मृत्युपुत्र, चालत वारस यांच्यावर
            बंधनकारक राहील व तो आम्ही व ते पाळतील.
          </p>

          <p className="mt-2">
            या बँकेच्या हद्दीत अंमलात असलेल्या सर्व पोटनियमांप्रमाणे तसेच या
            कर्जाच्या बाबतीत अंमलात असलेल्या नियमांप्रमाणे वागण्यास आम्ही
            बांधलेलो आहोत.
          </p>

          <p className="mt-2">
            मूल कर्जदाराने कर्जाची कबुली दिल्यानंतर वेळेवर फेड न केल्यास,
            थकलेल्या हप्त्याच्या रकमेवर मुदतीपासून S.I.I. म्हणजेच 2% या दराने
            जादा व्याज देण्यास आम्ही बांधलेलो आहोत. तसेच मूल कर्जदाराने नजर
            गहाणाच्या करारनाम्यात नमूद केलेल्या कोणत्याही अटींचा भंग केल्यास,
            बँकेच्या कर्जाच्या रकमेबाबत जी जी जबाबदारी त्याच्यावर राहील, ती ती
            संपूर्ण जबाबदारी आमच्यावर राहील.
          </p>

          <p className="mt-2">
            बँकेस आपली रक्कम, व्याज व खर्च वसूल करण्याचा प्रसंग आल्यास, बँकेने
            मूल कर्जदाराकडून नजर गहाण असलेली वस्तू ताब्यात घेऊन तिची विक्री करून
            त्यातून परस्पर रक्कम वसूल करून घ्यावी किंवा त्याच्यावर, तसेच
            आमच्यावर, लवाद/दावा करून हुकूमनामा मिळवून त्याची बजावणी आमच्यापैकी
            सर्वांवर किंवा एकट्यावर जातीवर किंवा इस्टेटवर एकत्रितपणे किंवा
            वेगवेगळ्या रीतीने वसूल करून घ्यावी.
          </p>

          <p className="mt-2">
            वरील करारनामा आम्ही वाचून, समजून, राजीखुशीने दिला आहे.
          </p>

          <div className="mt-1">
            <ol>
              {user?.guarantors?.map((guarantor, index) => (
                <li key={index}>
                  <p>
                    जामीनदार क्र. {index + 1}) {guarantor}{" "}
                    ____________________________
                  </p>
                </li>
              ))}
            </ol>
          </div>
        </div>
      </div>
    </>
  );
};

export default LoanSuretyForm;
